tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core", "https://github.com/Homebrew/homebrew-core.git"
tap "neovim/neovim"
tap "riscv/riscv"
# Archival front-end
brew "atool"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# GNU binary tools for native development
brew "binutils"
# Cross-platform make
brew "cmake"
# Reimplementation of ctags(1)
brew "ctags"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# XML 1.0 parser
brew "expat"
# GNU multiple precision arithmetic library
brew "gmp"
# C library for multiple-precision floating-point computations
brew "mpfr"
# GNU awk utility
brew "gawk"
# Distributed revision control system
brew "git"
# Generic library support script
brew "libtool"
# Source code tag system
brew "global"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Manage compile and link flags for libraries
brew "pkg-config"
# Integer Set Library for the polyhedral model
brew "isl"
# Library to talk to FTDI chips
brew "libftdi"
# C library for the arithmetic of high precision complex numbers
brew "libmpc"
# Next-gen compiler infrastructure
brew "llvm"
# Parser generator tool and incremental parsing library
brew "tree-sitter", args: ["HEAD"]
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim", args: ["HEAD"]
# Small build system for use with gyp or CMake
brew "ninja"
# On-chip debugging, in-system programming and boundary-scan testing
brew "open-ocd"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Substitute for classic 'make' tool with autoconf/automake functionality
brew "scons"
# STM32 discovery line Linux programmer
brew "stlink"
# Tool Command Language
brew "tcl-tk"
# User interface to the TELNET protocol
brew "telnet"
# Programmatically correct mistyped console commands
brew "thefuck"
# Vi 'workalike' with many additional features
brew "vim"
# Internet file retriever
brew "wget"
# General-purpose lossless data-compression library
brew "zlib"
# RISC-V toolchain including gcc (with newlib), simulator (spike), and pk
brew "riscv/riscv/riscv-tools"
cask "font-fira-code"
cask "font-hack"
# Development environment
cask "vagrant"
